app/Controllers/Book.php

SELECT *
FROM `books`
---
    public function index()
    {
        $data = [
            'title' => 'Data Buku Perpustakaan',
            'books' => $this->bookModel->findAll()

SELECT *
FROM `books`
WHERE `books`.`id` = '1'
---
    public function detail($id)
    {
        $data = [
            'title' => 'Detail Buku',
            'book'  => $this->bookModel->find($id)

SELECT *
FROM `books`
WHERE `books`.`id` = '1'
---
    public function edit($id)
    {
        $data = [
            'title' => 'Edit Data Buku',
            'book'  => $this->bookModel->find($id)

DELETE FROM `books`
WHERE `id` IN ('5')
---
    public function delete($id)
    {
        $this->bookModel->delete($id);

UPDATE `books` SET `title` = 'Laskar Pelangi', `author` = 'Andrea Hirata', `publisher` = 'Bentang Pustaka', `year` = '2006'
WHERE `books`.`id` IN ('1')
---
    public function update($id)
{
    $this->bookModel->update($id, [
        'title'     => $this->request->getPost('title'),
        'author'    => $this->request->getPost('author'),
        'publisher' => $this->request->getPost('publisher'),
        'year'      => $this->request->getPost('year'),
    ]);